
  ## Terraforming *Staging*
  #### Format: ✅
  #### Init:   ✅
  #### Plan:   ✅
  <details><summary>Show Plan</summary>
  <pre><code>Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_region.current: Refreshing state...
module.sns.data.aws_caller_identity.default: Refreshing state...
data.cloudfoundry_space.space: Refreshing state...
module.queue.cloudfoundry_user_provided_service.queue-credentials: Refreshing state... [id=1bd1626a-7a50-4de9-86c0-efba8e31bf1e]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.queue.data.aws_iam_policy_document.queue_alarm_sns_topic_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_alarm_sns_topic_policy_document"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "__default_policy_ID"

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow CloudwatchEvents"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.queue.data.aws_iam_policy_document.queue_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow reading and writing messages"
        }
    }

  # module.queue.aws_cloudwatch_metric_alarm.queue_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "queue_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors sqs message delays"
      + alarm_name                            = "federalist-staging-queue-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 900
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "staging"
        }
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # module.queue.aws_iam_access_key.queue_user_access_key will be created
  + resource "aws_iam_access_key" "queue_user_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-staging-sqs-user"
    }

  # module.queue.aws_iam_policy.queue_policy will be created
  + resource "aws_iam_policy" "queue_policy" {
      + arn         = (known after apply)
      + description = "SQS Queue Policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.queue.aws_iam_user.queue_user will be created
  + resource "aws_iam_user" "queue_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-staging-sqs-user"
      + path          = "/"
      + tags          = {
          + "Environment" = "staging"
        }
      + unique_id     = (known after apply)
    }

  # module.queue.aws_iam_user_policy_attachment.queue_user_policy_attach will be created
  + resource "aws_iam_user_policy_attachment" "queue_user_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "federalist-staging-sqs-user"
    }

  # module.queue.aws_sns_topic_policy.queue_alarm_sns_topic_policy will be created
  + resource "aws_sns_topic_policy" "queue_alarm_sns_topic_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.queue.aws_sqs_queue.queue will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "federalist-staging-sqs"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Environment" = "staging"
        }
      + visibility_timeout_seconds        = 30
    }

  # module.queue.cloudfoundry_user_provided_service.queue-credentials will be destroyed
  - resource "cloudfoundry_user_provided_service" "queue-credentials" {
      - credentials = (sensitive value)
      - id          = "1bd1626a-7a50-4de9-86c0-efba8e31bf1e" -> null
      - name        = "federalist-staging-sqs-creds" -> null
      - space       = "af7be42d-47d6-4b4d-a15a-7098c7695c43" -> null
      - tags        = [] -> null
    }

  # module.queue.cloudfoundry_user_provided_service.queue_credentials will be created
  + resource "cloudfoundry_user_provided_service" "queue_credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "federalist-staging-sqs-creds"
      + space       = "af7be42d-47d6-4b4d-a15a-7098c7695c43"
    }

  # module.sns.data.aws_iam_policy_document.topic_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "topic_policy_document"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "__default_policy_ID"

      + statement {
          + actions   = [
              + "SNS:AddPermission",
              + "SNS:DeleteTopic",
              + "SNS:GetTopicAttributes",
              + "SNS:ListSubscriptionsByTopic",
              + "SNS:Publish",
              + "SNS:Receive",
              + "SNS:RemovePermission",
              + "SNS:SetTopicAttributes",
              + "SNS:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "__default_statement_ID"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "960119293461",
                ]
              + variable = "AWS:SourceOwner"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.sns.aws_sns_topic.topic will be created
  + resource "aws_sns_topic" "topic" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_master_key_id = "alias/aws/sns"
      + name              = "federalist-staging-alerts-sns-alerts"
      + policy            = (known after apply)
      + tags              = {
          + "Environment" = "staging"
        }
    }

  # module.sns.aws_sns_topic_policy.topic_policy will be created
  + resource "aws_sns_topic_policy" "topic_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 10 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
</code></pre>
  </details>
